import UIKit

// 术语

// 赋值运算符 =

// 算数运算符 + - * / 加法运算符也可用于 String 的拼接

// 求余运算符（取模运算符） a % b

// 一元负号运算符 - 写在操作数之前，中间无空格

// 一元正号运算符 + 啥也不会改变（负数还是负数）

// 组合赋值运算符 += ex:a += 2 即 a = a + 2 的缩写

// 比较运算符 ==  !=  >  <  >=  <=  ===(恒等)  !==(不恒等)

// 三元运算符 ? :  if {} else {} 的简写

// 空合运算符  a ?? b  对可选类型 a 进行空判断，如果 a 包含一个值就进行解包，否则就返回一个默认值 b  a != nil ? a! : b 的简写

// 区间运算符  闭区间运算符  半开区间运算符  单侧区间
    // 闭区间运算符 (a...b) 包含从 a 到 b 到所有值的区间 a 的值不能超过 b
    // 半开区间运算符 (a..<b) 从 a 到 b 但不包括 b 到区间
    // 单侧区间 [2...] 可以表达往一侧无限延伸的区间 即从索引 2 到结尾的所有值的区间  [..<2]

// 逻辑运算符 && 与 || 或 ! 非
    // 逻辑非运算符 !a 对一个布尔值取反
    // 逻辑与运算符 a && b  只有当 a 和 b 的值都为 true 时，整个表达式的值才会是 true  [短路计算] 第一个不满足就不会计算第二个了
    // 逻辑或运算符  a || b 其中一个为 true 整个表达式为true

// 使用括号明确优先级
